[{"name": "Yeseva One", "description": "Yeseva One is a bold, classic serif display font known for its elegant and refined style. It offers sophistication, impact, and timeless beauty. Yeseva One is perfect for headlines, invitations, and luxury branding.", "keywords": ["display", "serif", "bold", "classic", "elegant"]}, {"name": "Work Sans", "description": "Work Sans is a modern, neutral sans-serif font designed for clean readability and professional use. It conveys clarity, simplicity, and approachability. Work Sans is ideal for interfaces, branding, and editorial content.", "keywords": ["sans-serif", "modern", "neutral", "readable", "clean"]}, {"name": "Vollkorn SC Black", "description": "Vollkorn SC Black is a bold, classic serif font with literary and formal qualities. It combines strength, tradition, and elegance. Vollkorn SC Black suits editorial headlines, formal branding, and literary publications.", "keywords": ["serif", "classic", "bold", "literary", "formal"]}, {"name": "Unica One", "description": "Unica One is a rounded, friendly display font with bold, modern shapes. It offers warmth, clarity, and approachability. Unica One is great for headlines, branding, and playful design projects.", "keywords": ["display", "bold", "modern", "rounded", "friendly"]}, {"name": "Ultra", "description": "Ultra is an elegant, bold display font designed for modern impact with refined letterforms. It radiates sophistication, strength, and style. Ultra is ideal for headlines, luxury branding, and editorial use.", "keywords": ["display", "bold", "modern", "impactful", "elegant"]}, {"name": "Ubuntu Bold", "description": "Ubuntu Bold is the bold weight of the Ubuntu font family, delivering strong, friendly, and readable typography. It conveys confidence, warmth, and clarity. Ubuntu Bold is perfect for headings, branding, and UI design.", "keywords": ["sans-serif", "modern", "bold", "readable", "friendly"]}, {"name": "Ubuntu", "description": "Ubuntu is a modern sans-serif font offering neutral readability with a friendly, approachable character. It combines clarity, warmth, and professionalism. Ubuntu is well-suited for interfaces, branding, and general text content.", "keywords": ["sans-serif", "modern", "neutral", "readable", "friendly"]}, {"name": "Stint Ultra Expanded", "description": "Stint Ultra Expanded is a bold, retro display font designed to grab attention with wide, impactful letterforms. It exudes vintage flair, boldness, and a dynamic presence. Stint Ultra Expanded works well for posters, headlines, and branding needing impact.", "keywords": ["display", "bold", "retro", "attention-grabbing", "impactful"]}, {"name": "Spectral Light", "description": "Spectral Light is a light-weight version of the Spectral serif font, offering a delicate, modern, and readable style with literary qualities. It conveys elegance, clarity, and sophistication. Spectral Light suits refined editorial and book design.", "keywords": ["serif", "modern", "literary", "light", "readable"]}, {"name": "Spectral", "description": "Spectral is a modern serif font designed for literary use with classic roots and excellent readability. It balances tradition, clarity, and elegance. Spectral is perfect for books, magazines, and long-form editorial projects.", "keywords": ["serif", "modern", "literary", "readable", "classic"]}, {"name": "Source Serif Pro", "description": "Source Serif Pro is a modern serif font designed for classic elegance combined with contemporary readability. It offers sophistication, clarity, and a formal tone. Source Serif Pro is ideal for books, academic publications, and editorial design.", "keywords": ["serif", "modern", "classic", "readable", "elegant"]}, {"name": "Source Sans Pro", "description": "Source Sans Pro is a modern, neutral sans-serif font designed for clean readability and professional use. It balances simplicity, clarity, and approachability. Source Sans Pro is widely used in user interfaces, editorial design, and branding.", "keywords": ["sans-serif", "modern", "neutral", "readable", "clean"]}, {"name": "Slabo 27px", "description": "Slabo 27px is a classic serif display font optimized for large-size readability with formal elegance. It conveys tradition, clarity, and sophistication. Slabo 27px suits headlines, titles, and formal editorial use.", "keywords": ["serif", "classic", "readable", "display", "formal"]}, {"name": "Slabo 13px", "description": "Slabo 13px is a classic serif display font designed specifically for screen readability at small sizes. It offers formality, clarity, and tradition. Slabo 13px is perfect for online articles, blogs, and editorial content.", "keywords": ["serif", "classic", "readable", "display", "formal"]}, {"name": "Sansita Black", "description": "Sansita Black is a bold, geometric sans-serif display font designed for strong, modern headlines. It conveys impact, clarity, and contemporary style. Sansita Black is great for advertising, branding, and editorial design.", "keywords": ["sans-serif", "display", "bold", "modern", "geometric"]}, {"name": "Sacramento", "description": "Sacramento is an elegant, flowing handwriting script font with a casual, stylish feel. It offers grace, approachability, and a relaxed personality. Sacramento works well for invitations, branding, and personal projects requiring a handwritten look.", "keywords": ["handwriting", "script", "casual", "elegant", "flowing"]}, {"name": "Rubik", "description": "Rubik is a geometric, rounded sans-serif font designed for a modern, friendly, and clean appearance. It feels approachable, professional, and versatile. Rubik is excellent for branding, user interfaces, and general typography.", "keywords": ["sans-serif", "geometric", "modern", "rounded", "friendly"]}, {"name": "Rokkitt Black", "description": "Rokkitt Black is a bold slab-serif display font with classic roots and strong presence. It conveys impact, tradition, and readability. Rokkitt Black is suitable for headlines, editorial design, and branding requiring a vintage touch.", "keywords": ["serif", "slab-serif", "bold", "display", "classic"]}, {"name": "Roboto Slab", "description": "Roboto Slab is a modern slab-serif font combining geometric forms with readable, neutral design. It balances solidity with clarity and approachability. Roboto Slab suits editorial design, branding, and user interfaces.", "keywords": ["serif", "slab-serif", "modern", "neutral", "readable"]}, {"name": "Roboto Regular", "description": "Roboto Regular is the neutral, clean, and readable standard weight of the Roboto sans-serif family. It offers clarity, professionalism, and approachability. Roboto Regular is perfect for body text, user interfaces, and digital content.", "keywords": ["sans-serif", "modern", "neutral", "readable", "clean"]}, {"name": "Roboto Mono Light", "description": "Roboto Mono Light is a light-weight monospace font created for technical and programming use with clean, modern lines. It conveys simplicity, clarity, and technical precision. Roboto Mono Light works well in coding environments and technical documents.", "keywords": ["monospace", "modern", "light", "technical", "programming"]}, {"name": "Roboto Mono Bold", "description": "Roboto Mono Bold is a bold monospace font designed for technical and programming environments with modern clarity. It offers precision, readability, and a strong presence. Roboto Mono Bold is ideal for code editors and technical documentation.", "keywords": ["monospace", "modern", "bold", "technical", "programming"]}, {"name": "Roboto Condensed", "description": "Roboto Condensed is a readable, modern sans-serif font with a compact form for space-efficient typography. It provides clarity, neutrality, and professionalism. Roboto Condensed suits interfaces, headlines, and body text in tight layouts.", "keywords": ["sans-serif", "modern", "condensed", "neutral", "readable"]}, {"name": "Roboto Black", "description": "Roboto Black is a bold, modern sans-serif font variant designed for strong, impactful display use. It conveys confidence, clarity, and professionalism. Roboto Black works well in headlines, branding, and digital interfaces.", "keywords": ["sans-serif", "modern", "bold", "display", "neutral"]}, {"name": "Roboto", "description": "Roboto is a modern sans-serif font created for neutral readability with clean, mechanical lines. It combines simplicity, professionalism, and approachability. Roboto is widely used for user interfaces, websites, and digital content.", "keywords": ["sans-serif", "modern", "neutral", "clean", "readable"]}, {"name": "Raleway Regular", "description": "Raleway Regular is the standard weight of the elegant, geometric sans-serif family designed for readability and refinement. It conveys simplicity, modernity, and clarity. Raleway Regular suits body text, interfaces, and editorial use.", "keywords": ["sans-serif", "geometric", "modern", "elegant", "readable"]}, {"name": "Raleway", "description": "Raleway is a geometric sans-serif font designed with elegance and display use in mind. It offers a modern, minimalist, and refined character. Raleway is ideal for headlines, branding, and sophisticated digital design.", "keywords": ["sans-serif", "geometric", "modern", "elegant", "display"]}, {"name": "Quicksand", "description": "Quicksand is a rounded sans-serif font with a modern, friendly, and minimalist style. It feels approachable, clean, and casual. Quicksand is suitable for branding, user interfaces, and informal content.", "keywords": ["sans-serif", "rounded", "modern", "friendly", "minimalist"]}, {"name": "Quattrocento Sans", "description": "Quattrocento Sans is a neutral, modern sans-serif font designed for clear readability and clean aesthetics. It conveys simplicity, professionalism, and approachability. Quattrocento Sans is perfect for user interfaces, branding, and body text.", "keywords": ["sans-serif", "neutral", "modern", "readable", "clean"]}, {"name": "Quattrocento", "description": "Quattrocento is a classic serif font designed for elegant, readable text with a literary tone. It offers tradition, warmth, and sophistication. Quattrocento is ideal for books, editorial content, and formal print use.", "keywords": ["serif", "classic", "literary", "elegant", "readable"]}, {"name": "Pt Sans", "description": "Pt Sans is a neutral, modern sans-serif font created for clear readability and professional communication. It combines simplicity, neutrality, and approachability. Pt Sans is suitable for web content, print, and user interfaces.", "keywords": ["sans-serif", "neutral", "readable", "modern", "clean"]}, {"name": "Proza Libre", "description": "Proza Libre is a modern sans-serif font focusing on neutral, clean, and readable text. It provides clarity, simplicity, and professionalism. Proza Libre works well in editorial design, interfaces, and general typography.", "keywords": ["sans-serif", "modern", "neutral", "readable", "clean"]}, {"name": "Prompt", "description": "Prompt is a modern sans-serif font designed for friendly, clean, and neutral readability. It offers simplicity, clarity, and approachability. Prompt is excellent for user interfaces, branding, and web content.", "keywords": ["sans-serif", "modern", "neutral", "clean", "friendly"]}, {"name": "Poppins", "description": "Poppins is a geometric sans-serif font featuring modern, clean lines with a neutral yet friendly character. It conveys simplicity, professionalism, and contemporary style. Poppins is suitable for headlines, branding, and digital content.", "keywords": ["sans-serif", "geometric", "modern", "neutral", "clean"]}, {"name": "Pontano Sans", "description": "Pontano Sans is a clean, modern sans-serif font designed for neutral readability and professional appearance. It offers clarity, simplicity, and approachability. Pontano Sans is ideal for body text, interfaces, and branding.", "keywords": ["sans-serif", "modern", "neutral", "clean", "readable"]}, {"name": "Poiret One Bold", "description": "Poiret One Bold is a modern sans-serif display font featuring geometric, elegant letterforms with strong presence. It radiates sophistication, clarity, and modernity. Poiret One Bold is great for headlines, branding, and contemporary editorial projects.", "keywords": ["sans-serif", "display", "bold", "modern", "elegant"]}, {"name": "Playfair Display", "description": "Playfair Display is a classic serif font with elegant high-contrast strokes designed for literary and formal display use. It conveys sophistication, tradition, and timeless beauty. Playfair Display is ideal for editorial headlines, invitations, and luxury branding.", "keywords": ["serif", "classic", "display", "elegant", "literary"]}, {"name": "Philosopher", "description": "Philosopher is a modern sans-serif font designed for neutral, readable, and clean typography. It balances clarity, simplicity, and professionalism. Philosopher is suitable for web design, branding, and editorial use.", "keywords": ["sans-serif", "modern", "neutral", "readable", "clean"]}, {"name": "Permanent Marker", "description": "Permanent Marker is a bold, informal handwriting script font that mimics felt-tip marker strokes. It feels casual, strong, and energetic. This font is perfect for creative headlines, posters, and personal branding.", "keywords": ["handwriting", "script", "bold", "informal", "display"]}, {"name": "Pacifico", "description": "Pacifico is a casual, bold handwriting script font with a playful and relaxed personality. It exudes friendliness, charm, and a beachy vibe. Pacifico is great for invitations, branding, and informal creative projects.", "keywords": ["handwriting", "script", "casual", "bold", "playful"]}, {"name": "PT Sans", "description": "PT Sans is a neutral, humanist sans-serif font designed for readability and clear communication. It balances professionalism, approachability, and modern simplicity. PT Sans is widely used in print and digital media for body text and interfaces.", "keywords": ["sans-serif", "neutral", "readable", "modern", "humanist"]}, {"name": "Oxygen", "description": "Oxygen is a modern, neutral sans-serif font designed for excellent readability and clean aesthetics. It provides simplicity, professionalism, and versatility. Oxygen is suitable for interfaces, websites, and editorial content.", "keywords": ["sans-serif", "modern", "neutral", "readable", "clean"]}, {"name": "Overpass", "description": "Overpass is a geometric sans-serif font offering modern readability with a neutral and clean design. It conveys clarity, professionalism, and simplicity. Overpass is suited for user interfaces, corporate branding, and general-purpose typography.", "keywords": ["sans-serif", "modern", "geometric", "readable", "neutral"]}, {"name": "Oswald Bold", "description": "Oswald Bold is a heavier weight of the Oswald font family, designed for maximum impact and clarity. It projects strength, professionalism, and modernity. Oswald Bold is excellent for headlines, signage, and branding requiring bold emphasis.", "keywords": ["sans-serif", "display", "bold", "modern", "impactful"]}, {"name": "Oswald", "description": "Oswald is a modern, bold sans-serif display font designed for impactful headlines and strong presence. It feels confident, clean, and contemporary. Oswald suits advertising, editorial titles, and digital branding.", "keywords": ["sans-serif", "display", "bold", "modern", "impactful"]}, {"name": "Open Sans Regular", "description": "Open Sans Regular is the standard weight of Open Sans, offering neutral, clean, and modern readability. It provides clarity and friendliness for a wide range of uses. This font is ideal for body text, interfaces, and corporate communication.", "keywords": ["sans-serif", "neutral", "readable", "modern", "clean"]}, {"name": "Open Sans Condensed", "description": "Open Sans Condensed is a compact variant of the Open Sans family, designed for modern readability in limited space. It conveys professionalism, clarity, and neutrality. It works well in user interfaces, headlines, and tight layouts.", "keywords": ["sans-serif", "condensed", "modern", "neutral", "readable"]}, {"name": "Open Sans", "description": "Open Sans is a neutral, modern sans-serif font designed for legibility and clean communication. It offers clarity, friendliness, and broad versatility. Open Sans is widely used in web design, branding, and user interfaces.", "keywords": ["sans-serif", "neutral", "readable", "modern", "clean"]}, {"name": "Nunito Semibold", "description": "Nunito Semibold is a semi-bold weight of the rounded sans-serif Nunito family, designed for modern clarity with a friendly tone. It conveys warmth, professionalism, and strong presence. Nunito Semibold suits headings, branding, and UI elements.", "keywords": ["sans-serif", "rounded", "modern", "friendly", "semi-bold"]}, {"name": "Nunito Sans", "description": "Nunito Sans is a clean, rounded sans-serif font combining modern neutrality with friendly shapes. It feels approachable, simple, and professional. Nunito Sans works well in interfaces, educational content, and casual branding.", "keywords": ["sans-serif", "rounded", "modern", "friendly", "neutral"]}, {"name": "Nunito", "description": "Nunito is a rounded, friendly sans-serif font designed for modern readability and approachability. It provides warmth, neutrality, and a clean aesthetic. Nunito is perfect for interfaces, branding, and user-centered design.", "keywords": ["sans-serif", "rounded", "modern", "friendly", "neutral"]}, {"name": "Noto Sans", "description": "Noto Sans is a neutral, minimalist sans-serif font designed for maximum readability and international script coverage. It embodies clarity, simplicity, and modernity. Noto Sans is ideal for global user interfaces, websites, and general text.", "keywords": ["sans-serif", "neutral", "readable", "modern", "minimalist"]}, {"name": "Nixie One", "description": "Nixie One is a bold, retro-inspired display script font with decorative features. It has a playful, vintage personality that grabs attention. Nixie One works well for branding, posters, and projects seeking a nostalgic yet bold look.", "keywords": ["display", "script", "retro", "bold", "decorative"]}, {"name": "Nanum Gothic", "description": "Nanum Gothic is a modern, geometric sans-serif font designed for clear readability and neutral tone. It blends modernity with legibility, offering a friendly but professional feel. Nanum Gothic is ideal for digital content, branding, and editorial use.", "keywords": ["sans-serif", "modern", "neutral", "readable", "geometric"]}, {"name": "Muli", "description": "Muli is a modern, minimalist sans-serif font offering neutral, clean, and highly readable typography. It conveys simplicity, clarity, and contemporary style. Muli is suitable for interfaces, branding, and general content design.", "keywords": ["sans-serif", "modern", "neutral", "clean", "minimalist"]}, {"name": "Montserrat Black", "description": "Montserrat Black is a bold, geometric sans-serif display font designed for strong impact and modern appeal. It radiates power, clarity, and presence. Montserrat Black is perfect for headlines, advertising, and branding that demands attention.", "keywords": ["sans-serif", "geometric", "bold", "display", "impactful"]}, {"name": "Montserrat", "description": "Montserrat is a geometric sans-serif font with a modern minimalist style characterized by bold, clean shapes. It conveys confidence, clarity, and urban sophistication. Montserrat is widely used in branding, headlines, and digital design.", "keywords": ["sans-serif", "geometric", "modern", "bold", "minimalist"]}, {"name": "Monoton", "description": "Monoton is a retro-inspired display script font featuring bold, decorative strokes. It evokes a vintage, dynamic, and eye-catching vibe. Monoton is suitable for headlines, logos, and creative projects seeking a bold retro aesthetic.", "keywords": ["display", "script", "bold", "retro", "decorative"]}, {"name": "Merriweather Sans", "description": "Merriweather Sans is a modern sans-serif font designed for neutral, clean readability. It balances simplicity, clarity, and approachability. Merriweather Sans is great for web design, interfaces, and general-purpose typography.", "keywords": ["sans-serif", "modern", "neutral", "readable", "clean"]}, {"name": "Merriweather Black", "description": "Merriweather Black is a bold display serif font offering strong presence with classic elegance. It conveys impact, sophistication, and readability. Merriweather Black works well for headlines, posters, and impactful editorial design.", "keywords": ["serif", "bold", "classic", "display", "impactful"]}, {"name": "Merriweather", "description": "Merriweather is a classic serif font designed for readability on screens with a literary, elegant tone. It provides warmth, tradition, and balanced contrast. Merriweather is ideal for body text in books, websites, and editorial projects.", "keywords": ["serif", "classic", "readable", "literary", "elegant"]}, {"name": "Lustria", "description": "Lustria is a modern serif font with classic roots, designed for formal readability with a polished appearance. It conveys elegance, professionalism, and clarity. Lustria is suitable for print, branding, and sophisticated editorial use.", "keywords": ["serif", "modern", "classic", "readable", "formal"]}, {"name": "Lora", "description": "Lora is a classic serif font designed for readable, elegant text with balanced contrast and a modern feel. It offers literary warmth, tradition, and clarity. Lora works well in books, websites, and editorial design.", "keywords": ["serif", "classic", "literary", "elegant", "readable"]}, {"name": "Lobster", "description": "Lobster is a bold, casual script font featuring lively, connected letterforms for a playful and informal feel. It exudes friendliness, charm, and approachability. Lobster is popular for branding, packaging, and display uses requiring a distinctive handwritten style.", "keywords": ["handwriting", "script", "casual", "bold", "display"]}, {"name": "Libre Baskerville", "description": "Libre Baskerville is a serif font inspired by the classic Baskerville typeface, designed for web readability and elegance. It conveys classic beauty, warmth, and literary refinement. Libre Baskerville is ideal for body text in books, websites, and editorial projects.", "keywords": ["serif", "classic", "literary", "readable", "elegant"]}, {"name": "Ledger", "description": "Ledger is a classic serif font designed for elegant, readable body text with a formal, literary feel. It offers sophistication, tradition, and clarity. Ledger is suited for books, magazines, and formal documents requiring a timeless tone.", "keywords": ["serif", "classic", "elegant", "literary", "formal"]}, {"name": "Lato", "description": "Lato is a modern sans-serif font designed for neutrality and excellent readability with subtle warmth. It conveys professionalism, approachability, and clarity. Lato is versatile, perfect for websites, corporate materials, and general-purpose typography.", "keywords": ["sans-serif", "modern", "neutral", "clean", "readable"]}, {"name": "Karla", "description": "Karla is a neutral sans-serif font designed for readability and modern clarity with a clean and approachable style. It provides warmth, simplicity, and professional neutrality. Karla works well for branding, editorial content, and user interfaces.", "keywords": ["sans-serif", "neutral", "modern", "readable", "clean"]}, {"name": "Josefin Sans", "description": "Josefin Sans is a geometric sans-serif font inspired by 1920s design, offering a minimalist and elegant style. It feels vintage, refined, and modern simultaneously. Josefin Sans is well suited for headlines, branding, and creative editorial projects.", "keywords": ["sans-serif", "geometric", "modern", "elegant", "minimalist"]}, {"name": "Inconsolata", "description": "Inconsolata is a modern monospace font designed for programming with clean, technical precision. It offers clarity, readability, and a technical, no-nonsense feel. Inconsolata is ideal for code editors, terminal displays, and technical documentation.", "keywords": ["monospace", "modern", "programming", "clean", "technical"]}, {"name": "IBM Plex Sans Condensed", "description": "IBM Plex Sans Condensed is a readable, modern sans-serif font designed with a compact form for efficient space use. It conveys professionalism, neutrality, and clarity. This font suits technical documents, interfaces, and branding requiring condensed typography.", "keywords": ["sans-serif", "modern", "condensed", "readable", "neutral"]}, {"name": "IBM Plex Sans Bold", "description": "IBM Plex Sans Bold is a modern sans-serif font designed for professional, bold communication with neutral clarity. It offers strength, precision, and a clean aesthetic. IBM Plex Sans Bold works well in corporate branding, user interfaces, and technical documents.", "keywords": ["sans-serif", "modern", "bold", "neutral", "professional"]}, {"name": "Hind", "description": "Hind is a neutral and modern sans-serif font designed for clear, clean readability. It feels practical, professional, and approachable. Hind is perfect for user interfaces, signage, and general-purpose typography.", "keywords": ["sans-serif", "neutral", "modern", "readable", "clean"]}, {"name": "Halant", "description": "Halant is a serif font combining classic literary elegance with modern readability and clean structure. It conveys tradition, refinement, and versatility. Halant is well suited for books, articles, and sophisticated editorial use.", "keywords": ["serif", "classic", "literary", "modern", "readable"]}, {"name": "Gravitas One", "description": "Gravitas One is a futuristic, bold display font created for modern, impactful typography with a sense of innovation. It radiates strength, modernity, and bold character. Gravitas One suits branding, headlines, and creative projects that want a futuristic feel.", "keywords": ["display", "bold", "modern", "futuristic", "impactful"]}, {"name": "Fugaz One", "description": "Fugaz One is a bold display font with modern, attention-grabbing shapes designed for impactful headlines. It feels dynamic, strong, and contemporary. Fugaz One is ideal for posters, advertising, and any design needing to draw the eye instantly.", "keywords": ["display", "bold", "modern", "impactful", "attention-grabbing"]}, {"name": "Francois One", "description": "Francois One is a modern sans-serif display font characterized by bold, impactful letterforms with excellent readability. It conveys confidence, strength, and modernity. Francois One works well for headlines, branding, and signage.", "keywords": ["sans-serif", "display", "bold", "modern", "impactful"]}, {"name": "Fjalla One", "description": "Fjalla One is a bold sans-serif display font designed for strong headlines with modern, clean lines. It delivers impact, clarity, and professionalism. Fjalla One is perfect for advertising, headlines, and digital interfaces requiring attention.", "keywords": ["sans-serif", "display", "bold", "modern", "headline"]}, {"name": "Fauna One", "description": "Fauna One is a modern serif font with humanist influences designed for readability and classic elegance. It balances tradition with contemporary clarity. Fauna One suits books, editorial work, and refined branding projects.", "keywords": ["serif", "classic", "readable", "modern", "humanist"]}, {"name": "Fanwood Text", "description": "Fanwood Text is a classic serif font designed for readable, elegant body text with formal and literary roots. It offers warmth, sophistication, and timeless beauty. Fanwood Text is excellent for books, academic papers, and formal documents.", "keywords": ["serif", "classic", "literary", "elegant", "formal"]}, {"name": "EB Garamond", "description": "EB Garamond is a classic serif font based on the timeless Garamond typeface, designed for literary elegance and formal use. It conveys tradition, refinement, and readability. EB Garamond is perfect for books, scholarly works, and elegant print design.", "keywords": ["serif", "classic", "literary", "elegant", "formal"]}, {"name": "Didact Gothic", "description": "Didact Gothic is a modern sans-serif font designed for neutrality and excellent readability. It projects clarity, simplicity, and professionalism. Didact Gothic suits educational materials, user interfaces, and clean design projects.", "keywords": ["sans-serif", "modern", "neutral", "clean", "readable"]}, {"name": "Crimson Text", "description": "Crimson Text is a serif font designed for literary use, inspired by old-style typefaces emphasizing readability and warmth. It provides a classic, elegant, and comfortable reading experience. Crimson Text is ideal for books, websites, and academic publications.", "keywords": ["serif", "classic", "literary", "elegant", "readable"]}, {"name": "Courgette", "description": "Courgette is a casual, flowing handwriting script font with elegant curves and a relaxed style. It feels friendly, approachable, and stylishly informal. Courgette is great for invitations, branding, and creative projects seeking a personal touch.", "keywords": ["handwriting", "script", "casual", "elegant", "flowing"]}, {"name": "Cormorant Garamond", "description": "Cormorant Garamond is a classic serif font inspired by Garamond with elegant, literary qualities and refined details. It conveys sophistication, tradition, and a formal tone. Cormorant Garamond works well for books, branding, and formal editorial projects.", "keywords": ["serif", "classic", "elegant", "literary", "formal"]}, {"name": "Cinzel", "description": "Cinzel is a serif display font inspired by classical Roman inscriptions, designed with elegance and decorative detail. It exudes formality, timelessness, and sophistication. Cinzel is suitable for luxury branding, invitations, and classic editorial work.", "keywords": ["serif", "display", "classic", "elegant", "decorative"]}, {"name": "Chivo", "description": "Chivo is a bold, modern sans-serif font built for clean, strong communication. It delivers clarity, power, and neutrality. Chivo is ideal for branding, headlines, and editorial use where impact is key.", "keywords": ["sans-serif", "modern", "bold", "neutral", "clean"]}, {"name": "Cardo", "description": "Cardo is a serif font designed specifically for scholarly texts, offering classic elegance and high legibility. It conveys professionalism, tradition, and literary refinement. Cardo is perfect for academic papers, historical documents, and formal publications.", "keywords": ["serif", "classic", "literary", "elegant", "formal"]}, {"name": "Cantarell", "description": "Cantarell is a clean, modern humanist sans-serif font designed for readability and neutrality. It conveys simplicity, clarity, and a fresh aesthetic. Cantarell works well for user interfaces, websites, and general-purpose typography.", "keywords": ["sans-serif", "humanist", "clean", "modern", "readable"]}, {"name": "Cabin", "description": "Cabin is a humanist sans-serif font designed with modern proportions and excellent readability. It provides warmth, neutrality, and clean simplicity. Cabin is perfect for body text, user interfaces, and approachable branding.", "keywords": ["sans-serif", "humanist", "modern", "readable", "neutral"]}, {"name": "Bevan", "description": "Bevan is a classic serif display font designed for strong headlines with bold strokes and high readability. It offers a timeless, elegant, and authoritative voice. Bevan is ideal for editorial titles, posters, and branding needing a vintage touch.", "keywords": ["serif", "display", "classic", "bold", "headline"]}, {"name": "Bebas Neue", "description": "Bebas Neue is a bold, uppercase sans-serif display font known for its clean, modern lines and strong presence. It exudes confidence, clarity, and impact. Bebas Neue is widely used in headlines, posters, and advertising requiring a commanding style.", "keywords": ["sans-serif", "display", "bold", "uppercase", "modern"]}, {"name": "Barlow", "description": "Barlow is a rounded sans-serif font designed for modern neutrality with a clean, soft appearance. It feels friendly, approachable, and versatile. Barlow is suitable for user interfaces, branding, and readable web content.", "keywords": ["sans-serif", "rounded", "modern", "neutral", "clean"]}, {"name": "Bangers", "description": "Bangers is a comic-inspired display font with bold, energetic letterforms designed to convey fun and excitement. It has a playful and impactful style perfect for casual or entertainment contexts. Bangers works well for comics, posters, and youthful branding.", "keywords": ["display", "comic", "bold", "fun", "impactful"]}, {"name": "Arvo", "description": "Arvo is a geometric slab-serif font created with a modern aesthetic balanced by readability. It evokes solidity, approachability, and classic geometric precision. Arvo is excellent for both headlines and body text in print and digital media.", "keywords": ["serif", "geometric", "modern", "readable", "slab-serif"]}, {"name": "Archivo Black", "description": "Archivo Black is a bold, modern sans-serif font designed for strong headlines and impactful communication. It projects power, clarity, and professionalism. Archivo Black suits editorial headlines, advertisements, and branding that demands attention.", "keywords": ["sans-serif", "bold", "modern", "strong", "headline"]}, {"name": "Architects Daughter", "description": "Architects Daughter is a casual handwriting font inspired by personal notes and sketches. It radiates friendliness, playfulness, and informality. This font is great for invitations, informal branding, and creative projects needing a personal touch.", "keywords": ["handwriting", "casual", "friendly", "informal", "playful"]}, {"name": "Andika", "description": "Andika is a neutral, readable sans-serif font designed for educational use and clear communication. It offers simplicity, clarity, and a modern feel. Andika works well in textbooks, e-learning platforms, and accessible design contexts.", "keywords": ["sans-serif", "readable", "neutral", "modern", "educational"]}, {"name": "Amatic SC", "description": "Amatic SC is an informal, narrow handwritten display font with quirky and playful characteristics. It conveys a casual, artistic, and distinctive personality. Amatic SC is popular for creative headlines, posters, and unique branding projects.", "keywords": ["handwriting", "display", "informal", "quirky", "narrow"]}, {"name": "Alice", "description": "Alice is a classic serif font designed for elegant literary works with formal and traditional influences. It embodies grace, refinement, and a sense of formality. Alice is well suited for novels, formal publications, and sophisticated print design.", "keywords": ["serif", "classic", "elegant", "literary", "formal"]}, {"name": "Alfa Slab One", "description": "Alfa Slab One is a bold slab-serif display font created to grab attention with modern, impactful shapes. It feels strong, assertive, and contemporary. Alfa Slab One is ideal for headlines, posters, and branding that demands a loud visual voice.", "keywords": ["slab-serif", "display", "bold", "modern", "impactful"]}, {"name": "Alegreya", "description": "Alegreya is a humanist serif font designed to provide readability and a harmonious rhythm for literary texts. It offers warmth, classic beauty, and a timeless literary feel. Alegreya is perfect for books, magazines, and long-form reading projects.", "keywords": ["serif", "humanist", "classic", "readable", "literary"]}, {"name": "Abril Fatface", "description": "Abril Fatface is a classic serif font inspired by heavy 19th-century display types used in posters and headlines. It conveys elegance, boldness, and a dramatic presence. Abril Fatface excels in editorial titles, advertising, and high-impact branding.", "keywords": ["serif", "display", "classic", "elegant", "bold"]}, {"name": "Abel", "description": "Abel is a geometric sans-serif font created with minimalist bold strokes suited for modern design. It projects confidence, clarity, and straightforwardness. Abel works well for headlines, branding, and contemporary digital projects.", "keywords": ["sans-serif", "geometric", "modern", "bold", "minimalist"]}, {"name": "ABeeZee", "description": "ABeeZee is a sans-serif font designed for maximum readability with a clean, modern, and neutral look. It offers a friendly and approachable feel with humanist influences. ABeeZee is great for web content, educational materials, and any project needing a simple yet warm typeface.", "keywords": ["sans-serif", "modern", "clean", "neutral", "readable", "humanist"]}, {"name": "Birthstone", "description": "Birthstone is an elegant and stylish script font featuring curly strokes and delicate loops. It evokes refinement, grace, and artistic flair. Birthstone is perfect for invitations, branding, and projects seeking a sophisticated, handwritten feel.", "keywords": ["Elegant", "Stylish", "Curly", "Script"]}, {"name": "Arimo", "description": "Arimo is a neutral and legible sans serif font created as a versatile alternative to Arial with strong clarity. It carries professionalism, simplicity, and straightforwardness. Arimo is ideal for user interfaces, corporate materials, and general-purpose communication.", "keywords": ["Neutral", "Legible", "Professional", "Sans serif"]}, {"name": "DM Sans", "description": "DM Sans is a clean and simple sans serif font designed for modern clarity and readability. It offers a minimal, contemporary, and approachable personality. DM Sans is suited for web interfaces, branding, and any project that values straightforward, legible typography.", "keywords": ["Clean", "Simple", "Modern", "Sans serif"]}, {"name": "Ooh Baby", "description": "Ooh Baby is a playful and casual script font with a handwritten, charming style. It expresses fun, cuteness, and a friendly, informal vibe. Ooh Baby works well in invitations, children’s content, and projects requiring a personal and lighthearted touch.", "keywords": ["Fun", "Cute", "Handwritten", "Script"]}, {"name": "Old Standard TT", "description": "Old Standard TT is a classic serif font inspired by traditional typesetting and designed for legibility and elegance. It embodies a timeless, graceful, and contrasted personality. Old Standard TT is ideal for book typography, academic publications, and projects seeking a historic or refined tone.", "keywords": ["Classic", "Graceful", "Contrasted", "Serif"]}, {"name": "Josefin Slab", "description": "Josefin Slab was inspired by 1920s geometric typefaces and designed as a vintage slab serif with thin strokes. It conveys a retro, stylish, and elegant vibe. Josefin Slab is great for headlines, branding, and creative editorial use.", "keywords": ["Vintage", "Geometric", "Thin", "Slab serif"]}, {"name": "Bree Serif", "description": "Bree Serif was designed by TypeTogether with friendly curves and contemporary warmth in a slab serif form. It offers personality, energy, and an approachable elegance. Bree Serif is suitable for advertising, editorial work, and branding with a friendly touch.", "keywords": ["Stylish", "Contemporary", "Friendly", "Slab serif"]}, {"name": "Praise", "description": "Praise was designed as a flowing and charming script with romantic and graceful curves. It exudes warmth, elegance, and expressiveness. Praise is perfect for invitations, personal projects, and branding with a romantic flair.", "keywords": ["Romantic", "Charming", "Flowing", "Script"]}, {"name": "Average", "description": "Average was designed as a warm and readable serif with balanced forms for comfortable reading. It conveys harmony, balance, and simplicity. Average is suited for body text, books, and projects requiring legibility and warmth.", "keywords": ["Warm", "Readable", "Balanced", "Serif"]}, {"name": "Caveat", "description": "Caveat was created by Pablo Impallari as a casual, handwritten script with natural spontaneity. It evokes friendliness, playfulness, and personal connection. Caveat is ideal for informal notes, personal branding, and creative projects looking for a human touch.", "keywords": ["Casual", "Handwritten", "Friendly", "Script"]}, {"name": "Pinyon Script", "description": "Pinyon Script was designed by Rob Leuschke as a romantic and elegant script with flowing curls and loops. It feels expressive, whimsical, and artistic. Pinyon Script is excellent for wedding invitations, greeting cards, and creative branding needing a personal touch.", "keywords": ["Romantic", "Elegant", "Curly", "Script"]}, {"name": "Inter", "description": "Inter was designed by Rasmus Andersson for digital interfaces prioritizing readability and performance. It is sleek, futuristic, and highly compatible with various screen sizes and uses. Inter is commonly used in UI design, websites, and apps requiring optimal legibility.", "keywords": ["Sleek", "Futuristic", "Performance", "Sans serif"]}, {"name": "Syne", "description": "Syne was designed by Indian Type Foundry as a creative and eccentric display font with tactile characteristics. It carries a whimsical, artistic energy with varied weights and expressive styles. Syne works well in headlines, logos, and creative branding needing a unique, eye-catching look.", "keywords": ["Creative", "Eccentric", "Tactile", "Display"]}, {"name": "Archivo", "description": "Archivo was created by Omnibus-Type inspired by 20th-century technical typography for high-performance use. It is modern, dynamic, and technical with strong, functional shapes. Archivo suits editorial, branding, and projects requiring clarity and impactful communication.", "keywords": ["Modern", "Dynamic", "Technical", "Slab serif"]}, {"name": "Teko", "description": "Teko was designed by Indian Type Foundry as a wide, condensed sans serif for display use. It projects a cutting-edge, futuristic vibe with its bold and wide structure. Teko is perfect for headlines, posters, and projects wanting to convey strength and modernity.", "keywords": ["Modern", "Futuristic", "Wide", "Sans serif"]}, {"name": "Fira Sans", "description": "Fira Sans was designed by Erik Spiekermann for Mozilla’s Firefox OS with a minimalist and modern approach. It embodies sleekness, futurism, and innovation with its clean shapes. Fira Sans is ideal for tech interfaces, apps, and futuristic branding projects.", "keywords": ["Modern", "Minimalist", "Futuristic", "Sans serif"]}, {"name": "Bitter", "description": "Bitter was created by Sol Matas as a slab serif with strong serifs and high contrast for digital reading. It conveys a stylish, contemporary feel with a solid and confident voice. Bitter is perfect for editorial projects, blogs, and websites emphasizing clarity and impact.", "keywords": ["Stylish", "Contemporary", "Strong", "Slab serif"]}, {"name": "Source Sans 3", "description": "Source Sans 3 is an evolution of Adobe’s Source Sans, designed for clean and simple UI use. It embodies professionalism, clarity, and versatility with a straightforward sans serif style. This font excels in interfaces, web content, and corporate design systems.", "keywords": ["Clean", "Simple", "Professional", "Sans serif"]}]
